# Data Cleaning in Pandas

### ETL

ETL stands for Extract, Transform, and Load. It’s a process used in data management to move data from various sources into a centralized data place for analysis and reporting. Here's a breakdown of each step:

    Extract: This is the process of gathering raw data from various sources such as databases, flat files, APIs, or web scraping. The goal is to extract data in its raw form, without changing or processing it.

    Transform: Once the data is extracted, it often needs to be cleaned, formatted, or aggregated. This step might include filtering out unwanted data, correcting errors, converting data types, merging different data sources, or performing calculations to prepare the data for analysis.

    Load: After transforming the data, it’s loaded into the target destination, which could be a database, data warehouse, or data lake. This is where it’s stored in a structured format that can be queried and analyzed.

In [576]:
# imports 
import pandas as pd 
import numpy as np

### Data Loading

In [577]:
# data loading 
df_yelp = pd.read_csv("./data/Yelp_Reviews.csv",index_col=0)
df_yelp.head()

,business_id,cool,date,funny,review_id,stars,text,useful,user_id
1,pomGBqfbxcqPv14c3XH-ZQ,0,2012-11-13,0,dDl8zu1vWPdKGihJrwQbpw,5.0,I love this place! My fiance And I go here atl...,0,msQe1u7Z_XuqjGoqhB0J5g
2,jtQARsP6P-LbkyjbO1qNGg,1,2014-10-23,1,LZp4UX5zK3e-c5ZGSeo3kA,1.0,Terrible. Dry corn bread. Rib tips were all fa...,3,msQe1u7Z_XuqjGoqhB0J5g
4,Ums3gaP2qM3W1XcA5r6SsQ,0,2014-09-05,0,jsDu6QEJHbwP2Blom1PLCA,5.0,Delicious healthy food. The steak is amazing. ...,0,msQe1u7Z_XuqjGoqhB0J5g
5,vgfcTvK81oD4r50NMjU2Ag,0,2011-02-25,0,pfavA0hr3nyqO61oupj-lA,NaN,This place sucks. The customer service is horr...,2,msQe1u7Z_XuqjGoqhB0J5g
10,yFumR3CWzpfvTH2FCthvVw,0,2016-06-15,0,STiFMww2z31siPY7BWNC2g,5.0,I have been an Emerald Club member for a numbe...,0,TlvV-xJhmh7LCwJYXkV-cg

In [578]:
df_yelp.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2610 entries, 1 to 4206
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   business_id  2610 non-null   object
 1   cool         2608 non-null   object
 2   date         2610 non-null   object
 3   funny        2610 non-null   int64
 4   review_id    2610 non-null   object
 5   stars        2607 non-null   float64
 6   text         2610 non-null   object
 7   useful       2610 non-null   int64
 8   user_id      2610 non-null   object
dtypes: float64(1), int64(2), object(6)
memory usage: 203.9+ KB

In [579]:
def multiply(x,y):
    return x*y

multiply(8,10)

80

### Lambda Functions

Lambda functions are often a convenient way to write throw-away functions on the fly. If you need to write a more complicated function you may still need to use the more formal def method, but lambda functions provide a quick and concise way to write function

In [580]:
def square(x):
    return x * x

In [581]:
def splitter(text):
    return len(text.split())

In [582]:
# an example of a lambda function 

# lambda x,y,z : x+y+z

df_yelp["text"].apply(lambda text: len(text.split()))

1        58
2        30
4        30
5        82
10       32
       ...
689      61
4874     43
564      79
3458    185
4206     42
Name: text, Length: 2610, dtype: int64

In [583]:
df_yelp["review_length"] = df_yelp["text"].apply(lambda text: len(text.split()))
df_yelp.head()

,business_id,cool,date,funny,review_id,stars,text,useful,user_id,review_length
1,pomGBqfbxcqPv14c3XH-ZQ,0,2012-11-13,0,dDl8zu1vWPdKGihJrwQbpw,5.0,I love this place! My fiance And I go here atl...,0,msQe1u7Z_XuqjGoqhB0J5g,58
2,jtQARsP6P-LbkyjbO1qNGg,1,2014-10-23,1,LZp4UX5zK3e-c5ZGSeo3kA,1.0,Terrible. Dry corn bread. Rib tips were all fa...,3,msQe1u7Z_XuqjGoqhB0J5g,30
4,Ums3gaP2qM3W1XcA5r6SsQ,0,2014-09-05,0,jsDu6QEJHbwP2Blom1PLCA,5.0,Delicious healthy food. The steak is amazing. ...,0,msQe1u7Z_XuqjGoqhB0J5g,30
5,vgfcTvK81oD4r50NMjU2Ag,0,2011-02-25,0,pfavA0hr3nyqO61oupj-lA,NaN,This place sucks. The customer service is horr...,2,msQe1u7Z_XuqjGoqhB0J5g,82
10,yFumR3CWzpfvTH2FCthvVw,0,2016-06-15,0,STiFMww2z31siPY7BWNC2g,5.0,I have been an Emerald Club member for a numbe...,0,TlvV-xJhmh7LCwJYXkV-cg,32

In [584]:
df_yelp.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2610 entries, 1 to 4206
Data columns (total 10 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   business_id    2610 non-null   object
 1   cool           2608 non-null   object
 2   date           2610 non-null   object
 3   funny          2610 non-null   int64
 4   review_id      2610 non-null   object
 5   stars          2607 non-null   float64
 6   text           2610 non-null   object
 7   useful         2610 non-null   int64
 8   user_id        2610 non-null   object
 9   review_length  2610 non-null   int64
dtypes: float64(1), int64(3), object(6)
memory usage: 224.3+ KB

### Lambda functions with conditionals

In [585]:
def sentiment(rating):
    if rating > 3:
        return "positive"
    else:
        return "Negative"

In [586]:
# conditionals simple example 

df_yelp["Sentiment"] = df_yelp["stars"].apply(lambda rating: "Positive" if rating > 3 else "Negative")

In [587]:
df_yelp.head()

,business_id,cool,date,funny,review_id,stars,text,useful,user_id,review_length,Sentiment
1,pomGBqfbxcqPv14c3XH-ZQ,0,2012-11-13,0,dDl8zu1vWPdKGihJrwQbpw,5.0,I love this place! My fiance And I go here atl...,0,msQe1u7Z_XuqjGoqhB0J5g,58,Positive
2,jtQARsP6P-LbkyjbO1qNGg,1,2014-10-23,1,LZp4UX5zK3e-c5ZGSeo3kA,1.0,Terrible. Dry corn bread. Rib tips were all fa...,3,msQe1u7Z_XuqjGoqhB0J5g,30,Negative
4,Ums3gaP2qM3W1XcA5r6SsQ,0,2014-09-05,0,jsDu6QEJHbwP2Blom1PLCA,5.0,Delicious healthy food. The steak is amazing. ...,0,msQe1u7Z_XuqjGoqhB0J5g,30,Positive
5,vgfcTvK81oD4r50NMjU2Ag,0,2011-02-25,0,pfavA0hr3nyqO61oupj-lA,NaN,This place sucks. The customer service is horr...,2,msQe1u7Z_XuqjGoqhB0J5g,82,Negative
10,yFumR3CWzpfvTH2FCthvVw,0,2016-06-15,0,STiFMww2z31siPY7BWNC2g,5.0,I have been an Emerald Club member for a numbe...,0,TlvV-xJhmh7LCwJYXkV-cg,32,Positive

In [588]:
def sentiment2(rating):
    if rating >=4:
        return "positive"
    elif rating >= 3 :
        return "Neutral"
    else:
        return "Negative"

In [589]:
df_yelp["stars"].apply(sentiment2).value_counts()

stars
positive    1743
Negative     649
Neutral      218
Name: count, dtype: int64

In [590]:
# conditionals if else 
df_yelp["stars"].apply(lambda rating: "positive" if rating >=4 else "Neutral" if rating >= 3 else "Negative")

1       positive
2       Negative
4       positive
5       Negative
10      positive
          ...
689     positive
4874    positive
564     positive
3458    Negative
4206    Negative
Name: stars, Length: 2610, dtype: object

### Todo

In [591]:
# repeat the conditional example using Normal functions

In [592]:
# repeat the Conditional if else example using Normal functions

## Data Cleaning in pandas

### Dealing with duplicates

Dealing with duplicated values in data involves identifying and handling redundant entries that may distort analysis or lead to incorrect conclusions.

In [593]:
df_yelp.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2610 entries, 1 to 4206
Data columns (total 11 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   business_id    2610 non-null   object
 1   cool           2608 non-null   object
 2   date           2610 non-null   object
 3   funny          2610 non-null   int64
 4   review_id      2610 non-null   object
 5   stars          2607 non-null   float64
 6   text           2610 non-null   object
 7   useful         2610 non-null   int64
 8   user_id        2610 non-null   object
 9   review_length  2610 non-null   int64
 10  Sentiment      2610 non-null   object
dtypes: float64(1), int64(3), object(7)
memory usage: 244.7+ KB

In [594]:
# check for duplicated values 
df_yelp.duplicated().value_counts()

False    2277
True      333
Name: count, dtype: int64

In [595]:
# View duplicates 
df_yelp[df_yelp.duplicated()].head(15)

,business_id,cool,date,funny,review_id,stars,text,useful,user_id,review_length,Sentiment
4252,fIuquIgWrkNEM5yvYSHPgw,2,2014-08-05,0,X4glBKsOvs6fgjHNJ0IUjw,5.0,What a compassionate and thorough professional...,3,xDjaGtx-TZUDdUxRKJnKCA,72,Positive
3028,_JD_U3pZDynB6l8swzVlQA,0,2017-12-17,0,iuVHqEglBCmL1lAbw8B2Ow,5.0,Had to switch barbers because I moved and the ...,0,WBKGxL53Tcq2_CkPavBYQA,93,Positive
3046,yQUXMWSA8H7wvkLa4iCD8g,0,2014-08-28,0,KmKCR_cHmAYA12Uy3XPHCA,2.0,Rude waitress and slow service. No offers for ...,1,KeYB7tU5F5PFb7X1QoWJ6Q,78,Negative
2322,1lLJDy73uBp_I2LJ0B0Fkw,1,2011-09-09,0,03dNKEDriDeZ8poYbiNyxQ,5.0,Was here for a party last weekend and had a bl...,0,ftLmo96CeyaNcVqHleDSHw,27,Positive
794,XXW_OFaYQkkGOGniujZFHg,0,2013-12-04,0,XxsMdJl8OTgeq5iEhp4JLQ,5.0,this is for the fireside lounge.\r\ngreat plac...,1,D1_nrBr4dOrs7M82OaBRwQ,37,Positive
1851,8XZ4X5WUyM1sWscObramwQ,0,2015-09-26,0,Y0npX3vZ1yp9RziQ-S-Djw,3.0,Boy for a Saturday they sure are slow! 13 peop...,0,uU_ol_n14rgh8kuuZ--WSQ,56,Negative
4593,7xn6RDKmCanq2C8Fn-FNgg,0,2015-11-08,0,IUbUpA1HznQZY8Ni8dF1tw,5.0,Honestly jill the owner absolutely gives the b...,0,2Eq5oRG-5dHajsPa2RIyEw,36,Positive
2894,xVEtGucSRLk5pxxN0t4i6g,1,2009-06-09,0,9bfnqemozlvKzbmc8gbItw,5.0,The best piece of meat I have ever had!!! This...,1,r2hoX58seF3kwP-U2W__QA,59,Positive
4129,YCEZLECK9IToE8Mysorbhw,0,2013-01-03,0,-1a7DLqgCV_s8Inzr0T7Dw,4.0,Very small portions but good food nonetheless....,0,INbqkFXtHeCdEP_wPp2dUA,21,Positive
2953,0yAJCh0TBZcnZkdZWZ6bVQ,0,2016-01-18,0,qrzJrDPyfqP7djhb6sxb3A,4.0,i've been going for over a year. great service...,0,Y5DIwt-653VndVu53ATpLQ,37,Positive
1071,EjYGxyksao-Jhw86tIAiYQ,0,2009-11-28,0,498PnbjX_IdBdjIVnegeJg,4.0,The Roast Pork was crispy and is better than S...,0,bsH9WdGVrFOjMlpDBNkWIA,55,Positive
311,gqdqnFg2lYeSyS20q2ZK_Q,0,2014-04-14,1,caHQiDwI7N9GyFRfOeOk5Q,1.0,I'm no sure if we got a bad box or not...but t...,0,KA3YwBSc1oqe7SzHErshJA,54,Negative
3726,DDlE4BTZDdbBmoZkIVRuxQ,0,2017-04-28,0,AlxZZp61yjv89vzHkR9BPw,5.0,Love all the staff and dentist here! Like fami...,0,tOIGjNwEkjAPA22Kc7XoLg,25,Positive
2217,UjvFjN1Aqp-pysEvpjelMg,0,2017-01-13,0,AXEe7ashu4GOMRX-oEjTGw,5.0,What else can I say about Mountain Park Chiro ...,0,VYU6ZQP58KkgqL2_o2QQhA,34,Positive
4863,vkQrIXyeAn4GrCnrk2haRw,0,2016-06-01,0,PozbovkjtUP8Gsw03qlglw,5.0,Always on-time and professional! The technicia...,0,UuhXs5GmOx9BEdLGJUXyEA,27,Positive

In [596]:
# removing  duplicated values 
df_yelp = df_yelp.drop_duplicates()

In [597]:
# verify that they have been removed

df_yelp.duplicated().value_counts()

False    2277
Name: count, dtype: int64

## Data Loading

In [598]:
# data loading for titanic dataset

df_titanic = pd.read_csv("./data/titanic.csv")
df_titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1.0,0.0,3,"Braund, Mr. Owen Harris",male,22.0,1.0,0.0,A/5 21171,7.2500,NaN,S
1,2.0,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0.0,PC 17599,71.2833,C85,C
2,3.0,1.0,3,"Heikkinen, Miss. Laina",female,26.0,0.0,0.0,STON/O2. 3101282,7.9250,NaN,S
3,4.0,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0.0,113803,53.1000,C123,S
4,5.0,0.0,3,"Allen, Mr. William Henry",male,35.0,0.0,0.0,373450,8.0500,NaN,S

In [599]:
# info
df_titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1391 entries, 0 to 1390
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  1391 non-null   float64
 1   Survived     1391 non-null   float64
 2   Pclass       1391 non-null   object
 3   Name         1391 non-null   object
 4   Sex          1391 non-null   object
 5   Age          1209 non-null   float64
 6   SibSp        1391 non-null   float64
 7   Parch        1391 non-null   float64
 8   Ticket       1391 non-null   object
 9   Fare         1391 non-null   float64
 10  Cabin        602 non-null    object
 11  Embarked     1289 non-null   object
dtypes: float64(6), object(6)
memory usage: 130.5+ KB

### Dealing with missing values

#### Detecting Null Values

In [600]:
# detecting null  values 
#isnull

df_titanic.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            182
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          789
Embarked       102
dtype: int64

## Strategies for dealing with missing data

Detecting missing values isn't enough -- we need to deal with them in order to move forward. We have three options for dealing with missing values -- removing them from the dataset, keeping them, or replacing them with another value

### Removing

The easiest way to deal with missing values is to drop the offending rows and/or columns. The downside to this is that we lose data in the process. This is a valid strategy on very large datasets -- however, on smaller datasets, throwing away data may be unacceptable

## Droping columns

In [601]:
# Dropping inplace 
# df_titanic.drop("Cabin",axis=1,inplace=True)
# df_titanic.info()

In [602]:
#df_titanic.dropna(axis=0,inplace=True)
#df_titanic.info()

In [603]:
# dropping and reasign
df_titanic = df_titanic.drop("Cabin",axis=1)

In [604]:
df_titanic.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            182
SibSp            0
Parch            0
Ticket           0
Fare             0
Embarked       102
dtype: int64

### Replacing Missing values (imputing)

**Continuous data**

For continuous data, the best solution is to replace the missing values with the median value for that column. The median value is a good choice because it is least likely to influence the distribution of the dataset overall. If the dataset is symmetric, then the mean and the median will be the same value. If the dataset is not symmetric, then the mean is more likely to be skewed by outlier values, so the median is a better choice.

In [605]:
# recheck  for missing values 
df_titanic.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            182
SibSp            0
Parch            0
Ticket           0
Fare             0
Embarked       102
dtype: int64

In [606]:
age_mediun = df_titanic["Age"].median()
age_mediun

27.0

In [607]:
# example 1
df_titanic["Age"] = df_titanic["Age"].fillna(age_mediun)

In [608]:
# recheck  for missing values 
df_titanic.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Embarked       102
dtype: int64

**Categorical data**

With categorical data, this is harder, since we don't have summary statistics to lean on such as the median or the mean. In this case, if one categorical value is much more common than others, it is a valid strategy to replace missing values with this common value. However, make sure to examine your data first. If all the categorical values are equally common, picking one to replace all the missing values may do more harm than good by skewing the distribution and introducing some false signal into your dataset

In [609]:
# recheck for missing values 
df_titanic.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Embarked       102
dtype: int64

In [616]:
df_titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1.0,0.0,3,"Braund, Mr. Owen Harris",male,22.0,1.0,0.0,A/5 21171,7.2500,S
1,2.0,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0.0,PC 17599,71.2833,C
2,3.0,1.0,3,"Heikkinen, Miss. Laina",female,26.0,0.0,0.0,STON/O2. 3101282,7.9250,S
3,4.0,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0.0,113803,53.1000,S
4,5.0,0.0,3,"Allen, Mr. William Henry",male,35.0,0.0,0.0,373450,8.0500,S

In [610]:
# most common value 
df_titanic["Embarked"].value_counts()

Embarked
S    830
C    285
Q    174
Name: count, dtype: int64

In [611]:
embarked_mode  = df_titanic["Embarked"].mode()
embarked_mode

0    S
Name: Embarked, dtype: object

In [612]:
# filling with a custom value 
# df_titanic["Embarked"] = df_titanic["Embarked"].fillna("M")

In [ ]:
# replacing with mode 
df_titanic["Embarked"] = df_titanic["Embarked"].fillna(embarked_mode)

In [618]:
# recheck for missing values 
df_titanic.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

In [615]:
df_titanic["Embarked"].value_counts()

Embarked
S    932
C    285
Q    174
Name: count, dtype: int64